jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/***************************************************************************//**
* \file cy_bootload.c
* \version 2.20
*
*  This file provides the implementation of Cypress Bootloader SDK.
*
********************************************************************************
* \copyright
* Copyright 2016-2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include <string.h>
#include "bootloader/cy_bootload.h"


#define CySoftwareReset() NVIC_SystemReset()

/** \cond INTERNAL */
CY_SECTION(".cy_boot_noinit.appId") __USED static uint8_t cy_bootload_appId;

/* The timeout for Cy_Bootload_Continue(), in milliseconds */
#define BOOTLOAD_DO_TIMEOUT                 (20u)
/* The timeout for the default Cy_Bootload__TransportWrite() call in milliseconds */
#define TRANSPORT_WRITE_TIMEOUT             (150u)   
/* The number of bytes per app in the metadata section */
#define METADATA_BYTES_PER_APP              (8u)

#define UINT16_SIZE                         (2u)
#define UINT32_SIZE                         (4u)

#define NIBBLE_POS                          (4u)
#define NIBBLE_MSK                          (0xFu)

#define SHA1_CHECKSUM_LENGTH                (20u)   /* The SHA1 length is 20 bytes */
/* A number of uint32_t elements in the SHA1 buffer */
#define SHA1_BUF_SIZE_UINT32                (SHA1_CHECKSUM_LENGTH/UINT32_SIZE)

#define RSA_CHECKSUM_LENGTH                 (256u)  /* The RSA public key modulo length is 2048 bits = 256 bytes */

#define CRC_CHECKSUM_LENGTH                 (4u)    /* The size of metadata flash row CRC in bytes */
#define CRC_POLYNOMIAL                      (0x1EDC6F41u) /* The CRC 32 polynomial */
#define CRC_LFSR_SEED                       (0xFFFFFFFFu)
#define CRC_DATA_REVERSE                    (1u)
#define CRC_DATA_XOR                        (0u)
#define CRC_REM_REVERSE                     (1u)
#define CRC_REM_XOR                         (0xFFFFFFFFu)
#define CRC_TABLE_SIZE                      (16u)           /* A number of uint32_t elements in the CRC32 table */
#define CRC_INIT                            (0xFFFFFFFFu)

#define CRC_CCITT_INIT                      (0xFFFFu)
#define CRC_CCITT_POLYNOMIAL                (0x8408u)

#define STATUS_BYTE_MSK                     (0xFFu)

/* The size in bytes of the bootloader command parameters */
#define PARAMS_SIZE                         (8u) 
/* The length in bytes of data in the "Set App Metadata" bootloader command */
#define DATA_LENGTH                         (9u) 
/* Possible sizes of the data field in the Bootloader packets */
#define DATA_PACKET_SIZE_4BYTES             (4u)
#define DATA_PACKET_SIZE_6BYTES             (6u)
#define DATA_PACKET_SIZE_8BYTES             (8u)
#define DATA_PACKET_SIZE_16BYTES            (16u)

#define PACKET_DATA_NO_OFFSET               (0u) 
#define PROGRAM_DATA_CRC_OFFSET             (4u) /* The offset in bytes to the CRC field in the Program Data command */
#define VERIFY_DATA_CRC_OFFSET              (4u) /* The offset in bytes to the CRC field in the Verify Data command */

/* The size in bytes of the data field in the Verify Application command */
#define VERIFY_APP_DATA_SIZE                (1u) 
/* The offset in bytes to the Application Length in the application metadata */
#define METADATA_APP_LENGTH_OFFSET          (4u) 
/* The offset in bytes to the application length in the data field of the Set Application Metadata command packet*/
#define SET_APP_METADATA_OFFSET             (1u) 
/* The offset to the application start address in the data field of the Set Application Metadata command packet */
#define SET_APP_METADATA_LENGTH_OFFSET      (5u) 
/* The offset to  the "to" part of the data field in the Get Metadata packet */
#define GET_METADATA_TO_OFFSET              (2u) 
  
/* The size in bytes of the App Size field in Cypress Simplified User Application Object */ 
#define SIMPLIFIED_APP_APPSIZE_SIZE         (4u)        

/* The offset in bytes to the VT offset in the Cypress Standard User Application Object */
#define CYPRESS_APP_VTOFFSET_OFFSET_BYTES   (0x10u) 
/* The offset in uint32 to the VT offset in the Cypress Standard User Application Object */
#define CYPRESS_APP_VTOFFSET_OFFSET_UINT32  (CYPRESS_APP_VTOFFSET_OFFSET_BYTES/UINT32_SIZE)
#define TOC_EMPTY                           (0UL) /* Both TOC2 and RTOC2 are empty */
#define TOC_INVALID                         (1UL) /* Either TOC2 or RTOC2 is invalid */
#define PUBLIC_KEY_IDX                      (9UL) /* The TOC item at index 9 is a public Key object  */
#define PUBLIC_KEY_OFFSET                   (8UL) /* The Public Key offset in the Public key Object */

/* The address of the the verify application function entry in the Flash Boot shared functions table */
#define VERIFY_APP_TABLE_ADDR               (0x16002040UL) 
/* The address of the the verify key function entry in the Flash Boot shared functions table */
#define IS_VALID_KEY_TABLE_ADDR             (0x16002044UL)
/* The address of the the verify TOC function entry in the Flash Boot shared functions table */
#define VALIDATE_TOC_TABLE_ADDR             (0x1600204CUL)

/* For the bootloader packet */
#define PACKET_SOP_VALUE                    (0x01u)
#define PACKET_EOP_VALUE                    (0x17u)
#define PACKET_SOP_IDX                      (0x00u)
#define PACKET_CMD_IDX                      (0x01u)
#define PACKET_SIZE_IDX                     (0x02u)
#define PACKET_DATA_IDX                     (0x04u)
#define PACKET_CHECKSUM_LENGTH              (2u)    /* The length in bytes of a packet checksum field */


/* The Flash Boot verification functions*/
#if(CY_BOOTLOAD_APP_FORMAT != CY_BOOTLOAD_BASIC_APP)
typedef bool (*Cy_FB_VerifyApp_t)(uint32_t address, uint32_t length, uint32_t signature, uint32_t publicKeyAddr);
typedef bool (*Cy_FB_IsValidKey_t)(uint32_t tocAddr, uint32_t publicKeyAddr);
typedef uint32_t (*Cy_FB_ValidateToc_t)(uint32_t tocAddress);
#endif /* (CY_BOOTLOAD_APP_FORMAT != CY_BOOTLOAD_BASIC_APP) */

/** \endcond */


