jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/* The static functions declaration */
static uint32_t ElfSymbolToAddr(void volatile const *symbol);
static void SwitchToApp(uint32_t stackPointer, uint32_t address);
#if ((CY_BOOTLOAD_OPT_CRYPTO_HW != 0) && (CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_BASIC_APP))
    static bool ComputeSha1(uint32_t address, uint32_t length, uint8_t *result);
#endif /*((CY_BOOTLOAD_OPT_CRYPTO_HW != 0) && (CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_BASIC_APP))*/

static uint16_t GetU16(uint8_t const array[]);
static uint32_t GetU32(uint8_t const array[]);
static void     PutU16(uint8_t array[], uint32_t offset, uint32_t value);

/* Because PutU32() is used only when updating the metadata */
#if CY_BOOTLOAD_METADATA_WRITABLE != 0
    static void PutU32(uint8_t array[], uint32_t offset, uint32_t value);
#endif
static uint32_t PacketChecksumIndex(uint32_t size);
static uint32_t PacketEopIndex(uint32_t size);
static uint32_t GetPacketCommand(const uint8_t packet[]);
static uint32_t GetPacketDSize(const uint8_t packet[]);
static uint8_t* GetPacketData(uint8_t packet[], uint32_t offset);
static uint32_t GetPacketChecksum(const uint8_t packet[], uint32_t packetSize);
static uint32_t ValidatePacketFooter(const uint8_t packet[], uint32_t packetSize);
static void SetPacketHeader(uint8_t packet[]);
static void SetPacketCmd(uint8_t packet[], uint32_t cmd);
static void SetPacketDSize(uint8_t packet[], uint32_t size);
static void SetPacketChecksum(uint8_t packet[], uint32_t size, uint32_t checksum);
static void SetPacketFooter(uint8_t packet[], uint32_t size);

static uint32_t PacketChecksum(const uint8_t buffer[], uint32_t size);
static cy_en_bootload_status_t VerifyPacket(uint32_t numberRead, const uint8_t packet[]);
static cy_en_bootload_status_t ReadVerifyPacket(uint8_t packet[], bool *noResponse, uint32_t timeout);
static cy_en_bootload_status_t WritePacket(cy_en_bootload_status_t status, uint8_t *packet, uint32_t rspSize);
static void EnterResponse(uint8_t *packet, uint32_t *rspSize, uint32_t *state);

static cy_en_bootload_status_t CopyToDataBuffer(uint8_t dataBuffer[], uint32_t *dataOffset, uint8_t const packet[], 
                                                uint32_t packetSize);

static cy_en_bootload_status_t CommandEnter(uint8_t *packet, uint32_t *rspSize, uint32_t *state, 
                                            cy_stc_bootload_params_t *params);
static cy_en_bootload_status_t CommandProgramData(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params);

#if CY_BOOTLOAD_OPT_ERASE_DATA != 0
static cy_en_bootload_status_t CommandEraseData(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params);
#endif
    
#if CY_BOOTLOAD_OPT_VERIFY_DATA != 0
static cy_en_bootload_status_t CommandVerifyData(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params);
#endif /* CY_BOOTLOAD_OPT_VERIFY_DATA != 0*/

#if CY_BOOTLOAD_OPT_SEND_DATA != 0
static cy_en_bootload_status_t CommandSendData(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params);
#endif /* CY_BOOTLOAD_OPT_SEND_DATA != 0 */

#if CY_BOOTLOAD_OPT_VERIFY_APP != 0
static cy_en_bootload_status_t CommandVerifyApp(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params);
#endif /* CY_BOOTLOAD_OPT_VERIFY_APP != 0 */

static cy_en_bootload_status_t CommandSetAppMetadata(uint8_t *packet, uint32_t *rspSize, 
                                                     cy_stc_bootload_params_t *params);

#if CY_BOOTLOAD_OPT_GET_METADATA != 0
static cy_en_bootload_status_t CommandGetMetadata(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params);
#endif /* CY_BOOTLOAD_OPT_GET_METADATA != 0 */

#if CY_BOOTLOAD_OPT_SET_EIVECTOR != 0
    static cy_en_bootload_status_t CommandSetEIVector(uint8_t *packet, uint32_t *rspSize,
                                                      cy_stc_bootload_params_t *params);
#endif /* CY_BOOTLOAD_OPT_SET_EIVECTOR != 0 */

static cy_en_bootload_status_t CommandUnsupported(uint8_t *packet, uint32_t *rspSize, 
                                                              cy_stc_bootload_params_t *params );
static cy_en_bootload_status_t ContinueHelper(uint32_t bootloaderCommand, uint8_t *packet, uint32_t *rspSize, 
                                              cy_stc_bootload_params_t *params, bool *noResponse);
#if(CY_BOOTLOAD_APP_FORMAT != CY_BOOTLOAD_BASIC_APP)
    #if(CY_BOOTLOAD_SEC_APP_VERIFY_TYPE == CY_BOOTLOAD_VERIFY_FAST)
        static bool VerifySecureAppShort(uint32_t verifyStartAddr, uint32_t verifyLength, uint32_t signatureAddr);
    #else
        static bool VerifySecureAppFull(uint32_t verifyStartAddr, uint32_t verifyLength, uint32_t signatureAddr);
    #endif /* CY_BOOTLOAD_SEC_APP_VERIFY_TYPE == CY_BOOTLOAD_VERIFY_FAST */
    bool VerifySecureApp(uint32_t verifyStartAddr, uint32_t verifyLength, uint32_t signatureAddr);
#endif/*(CY_BOOTLOAD_APP_FORMAT != CY_BOOTLOAD_BASIC_APP)*/


/*******************************************************************************
* Function Name: Cy_Bootload_DoBootload
****************************************************************************//**
*
* This function starts the application download and install operations.
* It calls Cy_Bootload_Init() and then continually calls Cy_Bootload_Continue().
* It does not return until the bootload operation is complete or an error
* is detected.
* This function provides an example of how to use the Bootloader SDK to quickly
* design a bootload system. \note This function blocks, suspending all other
* tasks until the bootload operation is complete. To execute other tasks
* while bootloading, design your code to call Cy_Bootload_Init() and
* Cy_Bootload_Continue() directly.
* Only one bootloading operation can be done at a time - the user's code must 
* ensure this. 
* \note The timeout for a communication interface is 20 ms - enough for
* UART (at 115200 bps), I2C, SPI, USB-HID, and BLE OTA in most cases.
* \note The function enables global interrupts.
*
* \param state      The pointer to a bootloading state variable.
*                   See \ref group_bootload_macro_state.
* \param timeout    The timeout in milliseconds for bootloading.
*
* \return See \ref cy_en_bootload_status_t.
*
*******************************************************************************/
cy_en_bootload_status_t  Cy_Bootload_DoBootload(uint32_t *state, uint32_t timeout)
{   
    /* The Bootloader parameters, used to configure a bootloader */
    cy_stc_bootload_params_t params;
    
    /* The status code for the Bootloader SDK API */
    cy_en_bootload_status_t status;
    
