jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
    /*
    * Used to count seconds, to convert counts to seconds use
    * counterTimeoutSeconds(SECONDS, BOOTLOAD_DO_TIMEOUT)
    */
    uint32_t count = 0u;
    bool finished = false; /* To exit do {} while () loop */
    
    /* The buffer to save bootloader commands to */
    CY_ALIGN(4) uint8_t buffer[CY_BOOTLOAD_SIZEOF_DATA_BUFFER];
    /* The buffer for packets sent and received with the Transport API */
    CY_ALIGN(4) uint8_t packet[CY_BOOTLOAD_SIZEOF_CMD_BUFFER ];
    
    /* Enable the global interrupts */
    __enable_irq();
    
    params.dataBuffer =   &buffer[0];
    params.packetBuffer = &packet[0];

#if CY_BOOTLOAD_OPT_SET_EIVECTOR != 0
    uint8_t elVectorBuffer[DATA_PACKET_SIZE_16BYTES];
    params.encryptionVector = &elVectorBuffer[0];
#endif /* CY_BOOTLOAD_OPT_SET_EIVECTOR != 0 */    
    
    status = Cy_Bootload_Init(state, &params);


    if (status != CY_BOOTLOAD_SUCCESS)
    {
        Cy_SysLib_Halt(0x00u);
    }
    
    /* Run the Bootloader */
    params.timeout = BOOTLOAD_DO_TIMEOUT;
    Cy_Bootload_TransportStart();

    do
    {
        
        status = Cy_Bootload_Continue(state, &params);
        if (*state == CY_BOOTLOAD_STATE_FINISHED)
        {
            /* The bootloading of the application image is finished, the image is valid */
            finished = true;
        }
        else if (*state == CY_BOOTLOAD_STATE_FAILED)
        {
            /* The bootloading has failed */
            finished = true;
        }
        else if (*state == CY_BOOTLOAD_STATE_BOOTLOADING)
        {
            count = 0u;
        }
        else
        {
            /* Empty */
        }
        ++count;

        /* No bootloader command received during the timeout period */
        if ( ( (count * BOOTLOAD_DO_TIMEOUT) >= timeout)
          && (*state == CY_BOOTLOAD_STATE_NONE   )  )
        {
            finished = true;
        }
    }
    while (!finished);
        
    Cy_Bootload_TransportStop();
    return (status);
}


/*******************************************************************************
* Function Name: Cy_Bootload_Init
****************************************************************************//**
*
* This function starts the application download and install operations.
* Make subsequent calls to Cy_Bootload_Continue() to continue the
* process. \n
* Returns immediately, reporting success or failure. \n
* Only one bootloading operation can be done at a time - the user's code must 
* ensure this.
*
* \param state      The pointer to a bootloading state variable
*                   See \ref group_bootload_macro_state 
* \param params     The pointer to a bootloader parameters structure
*                   See \ref cy_stc_bootload_params_t 
*
* \return See \ref cy_en_bootload_status_t.
* - \ref CY_BOOTLOAD_SUCCESS if successful.
* - \ref CY_BOOTLOAD_ERROR_UNKNOWN if a NULL pointer is passed.
* 
*******************************************************************************/
cy_en_bootload_status_t Cy_Bootload_Init(uint32_t *state, cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_SUCCESS;

    if ( (state == NULL) || (params == NULL) )
    {
        status = CY_BOOTLOAD_ERROR_UNKNOWN;
    }

    if (status == CY_BOOTLOAD_SUCCESS)
    {
        *state = CY_BOOTLOAD_STATE_NONE;
        params->dataOffset = 0u;
    }
    return (status);
}

/*******************************************************************************
* Function Name: Cy_Bootload_ExecuteApp
****************************************************************************//**
*
* This function transfers control from the current application to another 
* application.
* \note It is assumed appId is a valid application number.
*
* \param appId  An application number of the application to switch to.
*
*******************************************************************************/
void Cy_Bootload_ExecuteApp(uint32_t appId)
{
    CY_ASSERT(appId < CY_BOOTLOAD_MAX_APPS);
    cy_bootload_appId = (uint8_t)appId;
    CySoftwareReset();
}

/* Moves the argument address (R1) into the PC, moving execution to the address */
#if defined (__ARMCC_VERSION)
    static __asm void SwitchToApp(uint32_t stackPointer, uint32_t address)
    {
        MSR MSP, R0
        BX  R1
        ALIGN
    }
#elif defined(__GNUC__) 
    static void SwitchToApp(uint32_t stackPointer, uint32_t address )
    {
        __asm volatile("    MSR msp, %[sp]\n"
                       "    BX %[address] \n" : : [sp]"r"(stackPointer), [address]"r"(address) : "sp", "memory");
    }
#elif defined(__ICCARM__)
    #pragma optimize=no_inline
    static void SwitchToApp(uint32_t stackPointer, uint32_t address )
    {
        __asm volatile("MSR msp, R0\n"
                       "BX  R1     \n" );
    }
#endif  /* (__ARMCC_VERSION) */


/*******************************************************************************
* Function Name: Cy_Bootload_SwitchToApp
****************************************************************************//**
*
* This function switches to the application through the jump instruction.
*
* Before calling this function, ensure all the peripherals and bus masters are
* in a known state.
*
* \note It is assumed appId is a valid application number.
*
* \param appId      An application number of the application to switch to.
*
* \return If failed, returns the status code. See \ref cy_en_bootload_status_t.
* 
*******************************************************************************/
cy_en_bootload_status_t Cy_Bootload_SwitchToApp(uint32_t appId)
{
    uint32_t startAddress;
    cy_en_bootload_status_t status;
    
    CY_ASSERT(appId < CY_BOOTLOAD_MAX_APPS);
    
    status = Cy_Bootload_GetAppMetadata(appId, &startAddress, NULL);
    if (status == CY_BOOTLOAD_SUCCESS)
    {
    #if(CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_SIMPLIFIED_APP)
        uint32_t offsetVt = ((uint32_t *)(startAddress + SIMPLIFIED_APP_APPSIZE_SIZE))[0];
        startAddress += SIMPLIFIED_APP_APPSIZE_SIZE + offsetVt; 
    #elif(CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_CYPRESS_APP)
        uint32_t offsetVt = ((uint32_t *)startAddress)[CYPRESS_APP_VTOFFSET_OFFSET_UINT32];
        startAddress += CYPRESS_APP_VTOFFSET_OFFSET_BYTES + offsetVt; 
    #else
        /* No format: a basic application*/
    #endif
        uint32_t stackPointer = ((uint32_t *)startAddress)[0]; /* The Stack Pointer of the app to switch to */
        uint32_t resetHandler = ((uint32_t *)startAddress)[1]; /* Reset_Handler() address */
        SwitchToApp(stackPointer, resetHandler);
    }
    return (status);
}


