jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/*******************************************************************************
* Function Name: VerifySecureApp
****************************************************************************//**
*
* This function reports whether or not the specified application is valid.
*
* \param verifyStartAddr The start address of the application to verify.
* \param verifyLength The length of the application to verify.
* \param signatureAddr The address of the application signature.
*
* \return
*       - true - If the application is valid.
*       - false - If the application is invalid.
*
*******************************************************************************/
bool VerifySecureApp(uint32_t verifyStartAddr, uint32_t verifyLength, uint32_t signatureAddr)
{
#if(CY_BOOTLOAD_SEC_APP_VERIFY_TYPE == CY_BOOTLOAD_VERIFY_FAST)
    return VerifySecureAppShort(verifyStartAddr, verifyLength, signatureAddr);
#else
    return VerifySecureAppFull (verifyStartAddr, verifyLength, signatureAddr);
#endif /* CY_BOOTLOAD_SEC_APP_VERIFY_TYPE == CY_BOOTLOAD_VERIFY_FAST */
}
#endif/*(CY_BOOTLOAD_APP_FORMAT != CY_BOOTLOAD_BASIC_APP)*/


/*******************************************************************************
* Function Name: Cy_Bootload_ValidateApp
****************************************************************************//**
*
* This function reports whether or not the specified application is valid. \n
* This is a weak function and the user may override it in the user's code by 
* providing a function with the same name.
*
* \note It is assumed appId is a valid application number.
*
* \param appId      The application number of the application to be validated.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
* 
* \return See \ref cy_en_bootload_status_t.
* - \ref CY_BOOTLOAD_SUCCESS If the application is valid.
* - \ref CY_BOOTLOAD_ERROR_VERIFY If the application is invalid.
* 
*******************************************************************************/
__WEAK cy_en_bootload_status_t Cy_Bootload_ValidateApp(uint32_t appId, cy_stc_bootload_params_t *params)
{
    
    uint32_t appVerifyStartAddress;
    uint32_t appVerifySize;
    
    (void)params;
    
    CY_ASSERT(appId < CY_BOOTLOAD_MAX_APPS);
    
    cy_en_bootload_status_t status = Cy_Bootload_GetAppMetadata(appId, &appVerifyStartAddress, &appVerifySize);
    

    if (status == CY_BOOTLOAD_SUCCESS)
    {
    #if(CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_CYPRESS_APP)
        status = (VerifySecureApp(appVerifyStartAddress, appVerifySize, appVerifyStartAddress + appVerifySize))? 
                                  CY_BOOTLOAD_SUCCESS : CY_BOOTLOAD_ERROR_VERIFY;
    #elif (CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_SIMPLIFIED_APP)
        status = (VerifySecureApp(appVerifyStartAddress, appVerifySize, appVerifyStartAddress - RSA_CHECKSUM_LENGTH))?
                                  CY_BOOTLOAD_SUCCESS : CY_BOOTLOAD_ERROR_VERIFY;
    #else
        #if(CY_BOOTLOAD_OPT_CRYPTO_HW != 0)       
            uint32_t sha1buf[SHA1_BUF_SIZE_UINT32]; 
            uint32_t appFooterAddress = appVerifyStartAddress + appVerifySize;
            if (ComputeSha1(appVerifyStartAddress, appVerifySize, (uint8_t*)&sha1buf))
            { 
                status = (memcmp((const void *)sha1buf, (const void *)appFooterAddress, SHA1_CHECKSUM_LENGTH) == 0UL)? 
                                                                        CY_BOOTLOAD_SUCCESS : CY_BOOTLOAD_ERROR_VERIFY;
            }
            else
            {
                status = CY_BOOTLOAD_ERROR_VERIFY;
            }
        #else

            uint32_t appCrc = Cy_Bootload_DataChecksum((uint8_t *)appVerifyStartAddress, appVerifySize, params);
            uint32_t appFooterAddress = (appVerifyStartAddress + appVerifySize);
            status = (*(uint32_t*)appFooterAddress == appCrc) ? CY_BOOTLOAD_SUCCESS : CY_BOOTLOAD_ERROR_VERIFY;
        #endif/* (CY_BOOTLOAD_OPT_CRYPTO_HW != 0) */
    #endif /* (CY_BOOTLOAD_APP_FORMAT == CY_BOOTLOAD_CYPRESS_APP) */
    }
    return (status);
}


/*******************************************************************************
* Function Name: Cy_Bootload_GetRunningApp
****************************************************************************//**
*
* This function reports the application number of the currently running 
* application.
*
* \return See \ref cy_en_bootload_status_t.
* 
*******************************************************************************/
uint32_t Cy_Bootload_GetRunningApp(void)
{
    return ElfSymbolToAddr(&__cy_app_id);
}


/*******************************************************************************
* Function Name: Cy_Bootload_CopyApp
****************************************************************************//**
*
* This function copies an application from a temporary location in Flash to its 
* destination location in Flash. This function is typically called when updating 
* an application used as part of an update process, for example updating
* a BLE stack.
* \note This API is only for demonstration purpose, use it only when copying 
* from internal Flash to internal Flash. For other user cases, implement a 
* custom, more general function.
*
* \param destAddress  The start address of the application to copy to.
* \param srcAddress   The start address of the copy of the application to be 
*                     copied.
* \param length       The number of bytes to copy.
* \param rowSize      The size of a Flash row in bytes.
* \param params       The pointer to a bootloader parameters structure.
*                     See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t.
* 
*******************************************************************************/
cy_en_bootload_status_t Cy_Bootload_CopyApp(uint32_t destAddress, uint32_t srcAddress, uint32_t length,
                                            uint32_t rowSize, cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_UNKNOWN;
    uint32_t writeAddr  = destAddress;
    uint32_t readAddr   = srcAddress;
    uint32_t endAddress = destAddress + length;

