jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
    while (writeAddr < endAddress)
    {
        status = Cy_Bootload_ReadData(readAddr, rowSize, CY_BOOTLOAD_IOCTL_READ, params);
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            status = Cy_Bootload_WriteData(writeAddr, rowSize, CY_BOOTLOAD_IOCTL_WRITE, params);
        }
        if (status != CY_BOOTLOAD_SUCCESS)
        {
            break;
        }
        writeAddr += rowSize;
        readAddr  += rowSize;
    }
    
    return (status);
}


/*******************************************************************************
* Function Name: Cy_Bootload_OnResetApp0
****************************************************************************//**
*
* This function is used in an App0 firmware image in Reset_Handler() only.
* Checks if switching to the other application is scheduled with
* \ref Cy_Bootload_ExecuteApp(). \n
* If the switch is scheduled, then it validates the application and transfers
* control to it.
*
*******************************************************************************/
void Cy_Bootload_OnResetApp0(void)
{
    /* Set cy_bootload_appId to ZERO under a non-software reset. This means
     * that the Bootloader application is scheduled - the initial clean state. 
     * The value of cy_bootload_appId is valid only under a software reset.
     */    
    if (Cy_SysLib_GetResetReason() != CY_SYSLIB_RESET_SOFT)
    {
        cy_bootload_appId = 0u;
    }
    else
    {
        if (cy_bootload_appId != 0u)
        {
            (void) Cy_Bootload_SwitchToApp((uint32_t) cy_bootload_appId);
        }
    }
}


/*******************************************************************************
* Function Name: Cy_Bootload_ReadData
****************************************************************************//**
*
* This function must be implemented in the user's code.
* 
* Reads \c buffer from Flash, SMIF, or any other external memory type with
* custom pre and post read commands.
* 
* \param address    The address from where to read data, must be aligned to
*                   a Flash row, SMIF page, etc.
* \param length     The length in bytes of data to read, must be multiple of
*                   a Flash row, SMIF page, etc.
* \param ctl        Additional features of the read function:
* - CY_BOOTLOAD_IOCTL_READ    - Only read.
* - CY_BOOTLOAD_IOCTL_COMPARE - Compare the data in the buffer with the data in 
*                               memory.
* - CY_BOOTLOAD_IOCTL_BHP     - Decrypt data before comparing the buffer with 
*                               memory,
*   if the bootloader Host provided encrypted data.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
* \return See \ref cy_en_bootload_status_t
* - CY_BOOTLOAD_SUCCESS - If successful.
* - CY_BOOTLOAD_ERROR_LENGTH if \c The length value is invalid.
* - CY_BOOTLOAD_ERROR_ADDRESS if \c The address is invalid.
* 
*******************************************************************************/
__WEAK cy_en_bootload_status_t Cy_Bootload_ReadData (uint32_t address, uint32_t length, uint32_t ctl, 
                                                     cy_stc_bootload_params_t *params)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
    
    (void) address;
    (void) length;
    (void) ctl;
    (void) params;
    
    return (CY_BOOTLOAD_SUCCESS);
}


/*******************************************************************************
* Function Name: Cy_Bootload_WriteData
****************************************************************************//**
*
* This function must be implemented in the user's code.
* 
* Writes the \c buffer to Flash, SMIF, or any other external memory type with
* custom pre and post write commands.
* 
* \param address    The address to write data to, must be aligned to a Flash 
*                   row, SMIF page, etc.
* \param length     The length in bytes of data to be written, must be multiple 
*                   of a Flash row, SMIF page, etc.
* \param ctl        Additional features of the write function: 
* - CY_BOOTLOAD_IOCTL_WRITE - Only write.
* - CY_BOOTLOAD_IOCTL_ERASE - Erase the sector, the sector size can be bigger 
*   than the size of the page to write.
* - CY_BOOTLOAD_IOCTL_BHP   - Decrypt data before writing to memory, if 
*   the Bootloader Host provided encrypted data.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
* \return See \ref cy_en_bootload_status_t.
* - CY_BOOTLOAD_SUCCESS - If successful.
* - CY_BOOTLOAD_ERROR_LENGTH if \c The length value is invalid.
* - CY_BOOTLOAD_ERROR_ADDRESS if \c The address is invalid.
* 
*******************************************************************************/
__WEAK cy_en_bootload_status_t Cy_Bootload_WriteData(uint32_t address, uint32_t length, uint32_t ctl, 
                                                     cy_stc_bootload_params_t *params)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
    
    (void) address;
    (void) length;
    (void) ctl;
    (void) params;
    
    return (CY_BOOTLOAD_SUCCESS);
}


/*******************************************************************************
* Function Name: Cy_Bootload_TransportRead
****************************************************************************//**
* This function must be implemented in the user's code.
* 
* This function receives a command packet from the Bootloader Host via the 
* communication channel. The function waits for a timeout until all bytes are
* received.
*
* \param buffer The pointer to a buffer to store a received command.
* \param size   The number of bytes to read.
* \param count  The pointer to the variable that contains the number of received
*               bytes.
* \param timeout The time to wait before the function returns because of a 
*                timeout, in milliseconds.
*
* \return The status of the transmit operation:
* - CY_BOOTLOAD_SUCCESS - If successful.
* - CY_BOOTLOAD_ERROR_TIMEOUT - If no data is received.
* - See \ref cy_en_bootload_status_t.
*
*******************************************************************************/
__WEAK cy_en_bootload_status_t Cy_Bootload_TransportRead(uint8_t buffer[], uint32_t size, uint32_t *count, 
                                                         uint32_t timeout)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
    
    (void) buffer;
    (void) size;
    (void) count;
    (void) timeout;
    
    return (CY_BOOTLOAD_SUCCESS);
}


