jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/*******************************************************************************
* Function Name: Cy_Bootload_TransportWrite
****************************************************************************//**
* This function must be implemented in the user's code.
*
* This function transmits a response packet to the bootloader host via the 
* communication channel. The function waits for a timeout until all bytes are
* sent.
*
* \param buffer The pointer response packet buffer.
* \param size   The number of bytes to transmit.
* \param count  The pointer to the actual number of transmitted bytes.
* \param timeout The time to wait before the function returns because of a 
*        timeout, in milliseconds
*
* \return See \ref cy_en_bootload_status_t.
* The status of the transmit operation:
* - CY_BOOTLOAD_SUCCESS - If successful.
* - CY_BOOTLOAD_ERROR_TIMEOUT - If no data is transmitted.
* 
*******************************************************************************/
__WEAK cy_en_bootload_status_t Cy_Bootload_TransportWrite(uint8_t buffer[], uint32_t size, uint32_t *count, 
                                                          uint32_t timeout)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
    
    (void) buffer;
    (void) size;
    (void) count;
    (void) timeout;
    
    return (CY_BOOTLOAD_SUCCESS);
}


/*******************************************************************************
* Function Name: Cy_Bootload_TransportReset
****************************************************************************//**
*
* This function must be implemented in the user's code. \n
* Resets the communication interface with clearing buffers, offsets, length, 
* etc.
*
*******************************************************************************/
__WEAK void Cy_Bootload_TransportReset(void)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
}


/*******************************************************************************
* Function Name: Cy_Bootload_TransportStart
****************************************************************************//**
*
* This function must be implemented in the user's code. \n
* Starts the communication interface through which bootloading will be working.
*
*******************************************************************************/
__WEAK void Cy_Bootload_TransportStart(void)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
}


/*******************************************************************************
* Function Name: Cy_Bootload_TransportStop
****************************************************************************//**
*
* This function must be implemented in the user's code. \n
* Stops the communication interface through which bootloading will be working.
*
*******************************************************************************/
__WEAK void Cy_Bootload_TransportStop(void)
{
    /*
    * This function does nothing, weak implementation.
    * The purpose of this code is to disable compiler warnings for Non-optimized
    * builds which do not remove unused functions and require them for the 
    * completeness of the linking step.
    */
}


/*******************************************************************************
*        Cy_Bootload_Continue related code, till the EOF
*******************************************************************************/


/*******************************************************************************
* Function Name: GetU16
****************************************************************************//**
*
* This function is used to read a uint16_t value from a byte array. \n
* MISRA is informed with #pragma that the function has no side effects.
*
* \param array      The pointer to the byte array to get data from.
*
* \return The uint16_t value from the \c array parameter.
* 
*******************************************************************************/
static uint16_t GetU16(uint8_t const array[])
{
    uint16_t temp;
    (void) memcpy( &temp, &array[0], UINT16_SIZE);
    return (temp);
}


/*******************************************************************************
* Function Name: GetU32
****************************************************************************//**
*
* This function is used to read an uint32_t value from a byte array. \n
* MISRA is informed with #pragma that the function has no side effects.
*
* \param array      The pointer to the byte array to get data from.
*
* \return The uint32_t value from the \c array parameter.
* 
*******************************************************************************/
static uint32_t GetU32(uint8_t const array[])
{
    uint32_t temp;
    (void) memcpy( &temp, &array[0], UINT32_SIZE);
    return (temp);
}


/*******************************************************************************
* Function Name: PutU16
****************************************************************************//**
*
* This function is used to write an uint16_t value to a byte array.
*
* \param array      The pointer to the byte array.
* \param offset     The offset within the byte array to write data to.
* \param value      The value to be stored to the byte array.
*
*******************************************************************************/
static void PutU16(uint8_t array[], uint32_t offset, uint32_t value)
{
    (void) memcpy( &array[offset], &value, UINT16_SIZE);
}


#if CY_BOOTLOAD_METADATA_WRITABLE != 0
    /*******************************************************************************
    * Function Name: PutU32
    ****************************************************************************//**
    *
    * This function is used to write an uint32_t value to a byte array.
    *
    * \param array      The pointer to the byte array.
    * \param offset     The offset within the byte array to write data to.
    * \param value      The value to be stored to the byte array.
    *
    *******************************************************************************/
    static void PutU32(uint8_t array[], uint32_t offset, uint32_t value)
    {
        (void) memcpy( &array[offset], &value, UINT32_SIZE);
    }
#endif /* CY_BOOTLOAD_METADATA_WRITABLE != 0 */


