jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/*******************************************************************************
* Function Name: PacketChecksumIndex
****************************************************************************//**
*
* This function returns an index to the checksum field in a received packet 
*
* \param size The bootloader packet size value.
*
* \return The index to the checksum.
* 
*******************************************************************************/
static uint32_t PacketChecksumIndex(uint32_t size)
{
    return (PACKET_DATA_IDX + size);
}


/*******************************************************************************
* Function Name: PacketEopIndex
****************************************************************************//**
*
* This function returns an index to the end of the packet field in a received 
* packet.
*
* \param size  The bootloader packet size value.
*
* \return Returns an index to the end of the packet.
* 
*******************************************************************************/
static uint32_t PacketEopIndex(uint32_t size)
{ 
    return (PACKET_DATA_IDX + size + PACKET_CHECKSUM_LENGTH);
}


/*******************************************************************************
* Function Name: GetPacketCommand
****************************************************************************//**
*
* This function returns a bootloader packet command value for a given \c packet.
*
* \param packet  The pointer to the byte array containing bootloader packet
*                data.
*
* \return A bootloader packet command value.
* 
*******************************************************************************/
static uint32_t GetPacketCommand(const uint8_t packet[])
{
    return ( (uint32_t) packet[PACKET_CMD_IDX] );
}


/*******************************************************************************
* Function Name: GetPacketDSize
****************************************************************************//**
*
* This function returns a data size in the bootloader packet. \n
* MISRA requires this function have no side effects.
*
* \param packet  The pointer to the byte array containing bootloader packet
*                data.
*
* \return A size of the data in bytes in the packet.
* 
*******************************************************************************/
static uint32_t GetPacketDSize(const uint8_t packet[])
{
    return ( (uint32_t) GetU16( &packet[PACKET_SIZE_IDX] ) );
}


/*******************************************************************************
* Function Name: GetPacketData
****************************************************************************//**
*
* This function is used to get packet data.
*
* \param packet  The pointer to the byte array containing bootloader packet
*                data.
* \param offset  The offset within the data bytes in the packet.
*                E.g. 0 means the first byte of the data.
* 
* \return A pointer to the data bytes with the offset in the packet.
*
*******************************************************************************/
static uint8_t* GetPacketData(uint8_t packet[], uint32_t offset)
{
    return ( &packet[PACKET_DATA_IDX + offset] );
}


/*******************************************************************************
* Function Name: GetPacketChecksum
****************************************************************************//**
*
* This function is used to get a bootloader packet checksum.
*
* \param packet      The pointer to a byte array containing the
*                    bootloader packet data.
* \param packetSize  The offset within the data bytes in the packet. \n
*                    E.g. 0 means the first byte of the data.
* 
* \return The bootloader packet checksum.
*
*******************************************************************************/
static uint32_t GetPacketChecksum(const uint8_t packet[], uint32_t packetSize)
{
    return ( (uint32_t) GetU16( &packet[ PacketChecksumIndex(packetSize) ] ) );
}


/*******************************************************************************
* Function Name: ValidatePacketFooter
****************************************************************************//**
*
* This function is used to validate a bootloader packet footer.
*
* \param packet      The pointer to a byte array containing the 
*                    bootloader packet data.
* \param packetSize  The offset within the data bytes in the packet. \n
*                    E.g. 0 means the first byte of the data.
* \return
* - 0, if the bootloader packet footer is invalid.
* - 1, if the bootloader packet footer is valid.
*
*******************************************************************************/
static uint32_t ValidatePacketFooter(const uint8_t packet[], uint32_t packetSize)
{
    return ( (packet[PacketEopIndex(packetSize)] == PACKET_EOP_VALUE)? 1ul : 0ul );
}


/*******************************************************************************
* Function Name: SetPacketHeader
****************************************************************************//**
*
* This function is used to set a bootloader packet header value.
*
* \param packet     The pointer to a byte array containing the bootloader packet
*                   data.
*
*******************************************************************************/
static void SetPacketHeader(uint8_t packet[])
{
    packet[PACKET_SOP_IDX] = PACKET_SOP_VALUE;
}


/*******************************************************************************
* Function Name: SetPacketCmd
****************************************************************************//**
*
* This function is used to set a bootloader packet command value.
*
* \param packet     The pointer to a byte array containing the
*                   bootloader packet data.
* \param cmd        The command value to be set in the bootloader packet.
*
*******************************************************************************/
static void SetPacketCmd(uint8_t packet[], uint32_t cmd)
{
    packet[PACKET_CMD_IDX] = (uint8_t)cmd;
}


