jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/*******************************************************************************
* Function Name: CommandEnter
****************************************************************************//**
*
* This is a helper function for Cy_Bootload_Continue().
*
* This function is called to handle Command Enter, see the Bootloader Commands
* section in the Bootloader SDK User's Guide.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param state      The pointer to a bootloading state variable.
*                   See \ref group_bootload_macro_state.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t.
* 
*******************************************************************************/
static cy_en_bootload_status_t CommandEnter(uint8_t *packet, uint32_t *rspSize, uint32_t *state, 
                                            cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_LENGTH;
    volatile uint32_t productId = ElfSymbolToAddr(&__cy_product_id);
    uint32_t packetSize = GetPacketDSize(packet);
    *rspSize = CY_BOOTLOAD_RSP_SIZE_0;
    
    if (packetSize == 0u)  /* 'Product ID' not demanded */
    {
        status = (productId == 0u)? CY_BOOTLOAD_SUCCESS : CY_BOOTLOAD_ERROR_LENGTH;
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            EnterResponse(packet, rspSize, state);
        }
    }
    else if ( (packetSize == DATA_PACKET_SIZE_4BYTES) || (packetSize == DATA_PACKET_SIZE_6BYTES) )
    {
        status = CY_BOOTLOAD_ERROR_DATA;
        if (productId == GetU32(GetPacketData(packet, PACKET_DATA_NO_OFFSET) ) )
        {
            EnterResponse(packet, rspSize, state);
            status = CY_BOOTLOAD_SUCCESS;
        }
    }
    else
    {
        /* Empty */
    }
    
    params->appId = params->appId; /* Remove the unused warning */

    return (status);
}


/*******************************************************************************
* Function Name: CopyToDataBuffer
****************************************************************************//**
*
* This is a helper function, called in the following functions:
* - Bootload_CommandProgramData
* - CommandVerifyData
* - CommandSendData
*
* This is used to copy packet data to dataBuffer and increase dataOffset.
*
* \param dataBuffer     The pointer to a buffer containing the data to be
*                       written to an NVM.
* \param dataOffset     The offset within dataBuffer, indicates the current
*                       dataBuffer length.
* \param packet         The pointer to the bootloader packet buffer.
* \param packetSize     The length in bytes of the data in the bootloader
*                       packet buffer.
*
* \return See \ref cy_en_bootload_status_t
* 
*******************************************************************************/
static cy_en_bootload_status_t CopyToDataBuffer(uint8_t dataBuffer[], uint32_t *dataOffset, uint8_t const packet[], 
                                                uint32_t packetSize)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_UNKNOWN;
    if ( (dataBuffer != NULL) && (dataOffset != NULL) && (packet != NULL) )
    {
        status = CY_BOOTLOAD_ERROR_LENGTH;
        if ( (*dataOffset + packetSize) <= CY_BOOTLOAD_SIZEOF_DATA_BUFFER )
        {
            status = CY_BOOTLOAD_SUCCESS;
            (void) memcpy( &dataBuffer[*dataOffset], packet, packetSize);
            *dataOffset += packetSize;
        }
    }
    return (status);
}


/*******************************************************************************
* Function Name: CommandProgramData
****************************************************************************//**
*
* This a helper function for Cy_Bootload_Continue().
* This function is used to program data to an NVM.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t
* 
*******************************************************************************/
static cy_en_bootload_status_t CommandProgramData(uint8_t  *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params)
{   
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_LENGTH;
    uint8_t  *dataBufferLocal =  params->dataBuffer;
    uint32_t *dataOffsetLocal = &params->dataOffset;
    uint32_t  packetSize =  GetPacketDSize(packet);

    *rspSize = CY_BOOTLOAD_RSP_SIZE_0;
    if (packetSize >= PARAMS_SIZE)
    {
        uint32_t address =  GetU32( GetPacketData(packet, PACKET_DATA_NO_OFFSET) );
        uint32_t crc = GetU32( GetPacketData(packet, PROGRAM_DATA_CRC_OFFSET) );

        /* Data may be sent with the Program Data bootloader command, so copy it to dataBuffer */
        status = CopyToDataBuffer(dataBufferLocal, dataOffsetLocal, GetPacketData(packet, PARAMS_SIZE),
                                  packetSize - PARAMS_SIZE );
        
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            if (crc != Cy_Bootload_DataChecksum(dataBufferLocal, *dataOffsetLocal, params) )
            {
                status = CY_BOOTLOAD_ERROR_CHECKSUM;
            }
        }
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            status = Cy_Bootload_WriteData(address, *dataOffsetLocal, CY_BOOTLOAD_IOCTL_BHP, params);
        }
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            status = Cy_Bootload_ReadData (address, *dataOffsetLocal, CY_BOOTLOAD_IOCTL_COMPARE, params);
        }
    } /* if (packetSize >= PARAMS_SIZE) */
    *dataOffsetLocal = 0u;
    return (status);
}


