jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
/*******************************************************************************
* Function Name: CommandSetAppMetadata
****************************************************************************//**
* This is a helper function for Cy_Bootload_Continue().
* This function handles the Set Application Metadata bootloader command.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t
* 
*******************************************************************************/
static cy_en_bootload_status_t CommandSetAppMetadata(uint8_t *packet, uint32_t *rspSize, 
                                                     cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_SUCCESS;

    *rspSize = CY_BOOTLOAD_RSP_SIZE_0;

    if (GetPacketDSize(packet) != DATA_LENGTH)
    {
        status = CY_BOOTLOAD_ERROR_LENGTH;
    }
    
    if (status == CY_BOOTLOAD_SUCCESS)
    {
        /* Data offsets 0, 1, 5 are defined in the Bootloader Packet Structure */
        uint32_t app       =      *( GetPacketData(packet, PACKET_DATA_NO_OFFSET) );
        
    #if CY_BOOTLOAD_METADATA_WRITABLE != 0
        uint32_t verifyAddress = GetU32( GetPacketData(packet, SET_APP_METADATA_OFFSET) );
        uint32_t verifySize   = GetU32( GetPacketData(packet, SET_APP_METADATA_LENGTH_OFFSET) );
        
        status = Cy_Bootload_SetAppMetadata(app, verifyAddress, verifySize, params);
    #endif
        
        params->appId = app;
    }
    return (status);
}


#if CY_BOOTLOAD_OPT_GET_METADATA != 0
/*******************************************************************************
* Function Name: CommandGetMetadata
****************************************************************************//**
* This is a helper function for Cy_Bootload_Continue().
* This function handles the Get Metadata bootloader command.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t
*
*******************************************************************************/
static cy_en_bootload_status_t CommandGetMetadata(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_SUCCESS;
    uint32_t locRspSize = CY_BOOTLOAD_RSP_SIZE_0;
    
    if (packet == NULL)
    {
        status = CY_BOOTLOAD_ERROR_UNKNOWN;
    }
    if (status == CY_BOOTLOAD_SUCCESS)
    {
        if (GetPacketDSize(packet) != DATA_PACKET_SIZE_4BYTES)
        {
            status = CY_BOOTLOAD_ERROR_LENGTH;
        }
    }
    if (status == CY_BOOTLOAD_SUCCESS)
    {
        uint32_t fromAddr = GetU16( GetPacketData(packet, PACKET_DATA_NO_OFFSET) );
        uint32_t toAddr   = GetU16( GetPacketData(packet, GET_METADATA_TO_OFFSET) );
        if ( (toAddr < fromAddr)
          || ( ( (toAddr - fromAddr) + CY_BOOTLOAD_PACKET_MIN_SIZE) > CY_BOOTLOAD_SIZEOF_CMD_BUFFER) )
        {
            status  = CY_BOOTLOAD_ERROR_DATA;
        }
        else
        {
            uint32_t metadataAddr    = ElfSymbolToAddr(&__cy_boot_metadata_addr  );
            uint32_t metadataLength  = ElfSymbolToAddr(&__cy_boot_metadata_length);

            status = Cy_Bootload_ValidateMetadata(metadataAddr, params);
            if (status == CY_BOOTLOAD_SUCCESS)
            {
                status = Cy_Bootload_ReadData(metadataAddr, metadataLength, CY_BOOTLOAD_IOCTL_READ, params);
            }
            if (status == CY_BOOTLOAD_SUCCESS)
            {
                locRspSize = (toAddr - fromAddr);
                (void) memmove( GetPacketData(packet, PACKET_DATA_NO_OFFSET), 
                                &(params->dataBuffer[fromAddr]), 
                                locRspSize);
                status = CY_BOOTLOAD_SUCCESS;          
            }
        }
    }
    *rspSize = locRspSize; 
    return (status);
}
#endif /* CY_BOOTLOAD_OPT_GET_METADATA != 0 */


#if CY_BOOTLOAD_OPT_SET_EIVECTOR != 0
/*******************************************************************************
* Function Name: CommandSetEIVector
****************************************************************************//**
*
* This is a helper function for Cy_Bootload_Continue().
* This function copies the Encryption Initial Vector value from the bootloader 
* command buffer to the buffer pointed by 
* \code params->encryptionVector \endcode.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t.
* 
*******************************************************************************/
static cy_en_bootload_status_t CommandSetEIVector(uint8_t *packet, uint32_t *rspSize, cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_SUCCESS;
    *rspSize = CY_BOOTLOAD_RSP_SIZE_0;
    
    uint32_t size = GetPacketDSize(packet);
    
    if (( (size == 0u) ||  (size == DATA_PACKET_SIZE_8BYTES) 
        || (size == DATA_PACKET_SIZE_16BYTES) ) && (params->encryptionVector != NULL))
    {
        memcpy(params->encryptionVector, GetPacketData(packet, PACKET_DATA_NO_OFFSET), size);
    }
    else
    {
        status = CY_BOOTLOAD_ERROR_DATA;
    }
    
    return (status);
}
#endif /* CY_BOOTLOAD_OPT_SET_EIVECTOR != 0 */


/*******************************************************************************
* Function Name: CommandUnsupported
****************************************************************************//**
*
* This is a helper function for Cy_Bootload_Continue().
* This function responses to an unsupported command.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t
* 
*******************************************************************************/
static cy_en_bootload_status_t CommandUnsupported(uint8_t packet[], uint32_t *rspSize, cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_CMD;

