jsalazizzle/SmartHandle/SmartHandle.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.c
    /* To remove the compiler warnings */
    (void)packet;
    params->dataOffset = 0u;

    *rspSize = CY_BOOTLOAD_RSP_SIZE_0;
    return (status);
}


/*******************************************************************************
* Function Name: ContinueHelper
****************************************************************************//**
* This is a helper function for Cy_Bootload_Continue(). This function parses
*  most of the bootloader commands.
*
* \param packet     The pointer to the bootloader packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t .
*
* \return See \ref cy_en_bootload_status_t
* 
*******************************************************************************/
static cy_en_bootload_status_t ContinueHelper(uint32_t bootloaderCommand, uint8_t *packet, uint32_t *rspSize, 
                                              cy_stc_bootload_params_t *params, bool *noResponse)
{
    /* Set to a close warning (status may be used uninitialized)*/
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_UNKNOWN; 
    switch (bootloaderCommand)
    {
    case CY_BOOTLOAD_CMD_PROGRAM_DATA:
        status = CommandProgramData(packet, rspSize, params);
        break;

#if CY_BOOTLOAD_OPT_VERIFY_DATA != 0
    case CY_BOOTLOAD_CMD_VERIFY_DATA:
        status = CommandVerifyData(packet, rspSize, params);
        break;
#endif /* CY_BOOTLOAD_OPT_VERIFY_DATA != 0 */

#if CY_BOOTLOAD_OPT_ERASE_DATA != 0
    case CY_BOOTLOAD_CMD_ERASE_DATA:
        status = CommandEraseData(packet, rspSize, params);
        break;
#endif /* CY_BOOTLOAD_OPT_ERASE_DATA != 0 */

#if CY_BOOTLOAD_OPT_VERIFY_APP != 0
    case CY_BOOTLOAD_CMD_VERIFY_APP:
        status = CommandVerifyApp(packet, rspSize, params);
        break;
#endif /* CY_BOOTLOAD_OPT_VERIFY_APP != 0 */

#if CY_BOOTLOAD_OPT_SEND_DATA != 0
    case CY_BOOTLOAD_CMD_SEND_DATA_WR:
        *noResponse = true;
        status = CommandSendData(packet, rspSize, params);
        break;
        
    case CY_BOOTLOAD_CMD_SEND_DATA:
        status = CommandSendData(packet, rspSize, params);
        break;
#endif /* CY_BOOTLOAD_NO_CMD_SEND_DATA == 0 */

    case CY_BOOTLOAD_CMD_SYNC: /* If something fails, then the Host sends this command to reset the Bootloader */
        params->dataOffset = 0u;
        *noResponse = true;
        break;

    case CY_BOOTLOAD_CMD_SET_APP_META:
        status = CommandSetAppMetadata(packet, rspSize, params);
        break;

#if CY_BOOTLOAD_OPT_GET_METADATA != 0
    case CY_BOOTLOAD_CMD_GET_METADATA:
        status = CommandGetMetadata(packet, rspSize, params);
        break;
#endif /* CY_BOOTLOAD_OPT_GET_METADATA != 0 */

#if CY_BOOTLOAD_OPT_SET_EIVECTOR != 0
    case CY_BOOTLOAD_CMD_SET_EIVECTOR:
        status = CommandSetEIVector(packet, rspSize, params);
        break;
#endif /* CY_BOOTLOAD_OPT_SET_EIVECTOR != 0 */

    default:
        status = CommandUnsupported(packet, rspSize, params);
        break;
    } /* switch (bootloaderCommand) */
    return (status);
}


/*******************************************************************************
* Function Name: Cy_Bootload_Continue
****************************************************************************//**
*
* This function causes the Bootloader to attempt to read data being transmitted 
* by the Host application.  If data is sent from the Host, this establishes the
* communication interface to process all requests.
*
* \param state      The pointer to a bootloading state variable.
*                   See \ref group_bootload_macro_state.
* \param params     The pointer to a bootloader parameters structure.
*                   See \ref cy_stc_bootload_params_t.
*
* \return See \ref cy_en_bootload_status_t
* 
*******************************************************************************/
cy_en_bootload_status_t Cy_Bootload_Continue(uint32_t *state, cy_stc_bootload_params_t *params)
{
    cy_en_bootload_status_t status = CY_BOOTLOAD_ERROR_UNKNOWN; /* Give a value to a close warning */
    uint8_t *packet = params->packetBuffer; /* Receive/Transmit buffer */  

    uint32_t rspSize = CY_BOOTLOAD_RSP_SIZE_0;
    bool noResponse = false;        /* Indicates whether to send a response packet back to the Host */

    CY_ASSERT(params->timeout != 0u);
    CY_ASSERT(params->dataBuffer != NULL);
    CY_ASSERT(params->packetBuffer != 0);

    
    if ( (*state == CY_BOOTLOAD_STATE_NONE) || (*state == CY_BOOTLOAD_STATE_BOOTLOADING) )
    {
        status = ReadVerifyPacket(packet, &noResponse, params->timeout);
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            uint32_t bootloaderCommand = GetPacketCommand(packet);

            if      (bootloaderCommand == CY_BOOTLOAD_CMD_ENTER)
            {
                status = CommandEnter(packet, &rspSize, state, params);
            }
            else if (bootloaderCommand == CY_BOOTLOAD_CMD_EXIT)
            {
                *state = CY_BOOTLOAD_STATE_FINISHED;
                noResponse = true;
            }
            else if (*state != CY_BOOTLOAD_STATE_BOOTLOADING)
            {
                status = CY_BOOTLOAD_ERROR_CMD;
            }
            else
            {
                status = ContinueHelper(bootloaderCommand, packet, &rspSize, params, &noResponse);
            }
        }

        if (!noResponse)
        {
            (void) WritePacket(status, packet, rspSize);
        }
    }
    else
    {
        /* empty */
    }
    return (status);
}


/* [] END OF FILE */
